app/controllers/ingredient_lists_controller.rb

SELECT "ingredient_lists".* FROM "ingredient_lists"
---
  def index
    @ingredient_lists = IngredientList.all

SELECT "ingredients".* FROM "ingredients"
---
  def find_all_ingredients
    @ingredients = Ingredient.all