app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @ingredient = Ingredient.find(params[:id])

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @ingredient = Ingredient.find(params[:id])

INSERT INTO "ingredients" ("created_at", "name", "nutritional_info", "serving", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 16 Jan 2013 00:45:06 UTC +00:00], ["name", "Tomato Paste"], ["nutritional_info", ""], ["serving", ""], ["updated_at", Wed, 16 Jan 2013 00:45:06 UTC +00:00]]
---
  def create
    @ingredient = Ingredient.new(params[:ingredient])

    respond_to do |format|
      if @ingredient.save

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "ingredients" SET "name" = 'Eggs', "updated_at" = '2013-01-16 00:45:25.090296' WHERE "ingredients"."id" = 1
---
  def update
    @ingredient = Ingredient.find(params[:id])

    respond_to do |format|
      if @ingredient.update_attributes(params[:ingredient])